# ToggleButton Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ToggleButton Class
Members See Also
---
The ToggleButton object represents a button that has been added to a RadioButtonGroup.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class ToggleButton : PushButton
```

Visual Basic
---
```text
Public Class ToggleButton _
	Inherits PushButton
```

Visual C++
---
```text
public ref class ToggleButton : public PushButton
```

# Remarks
Use of this class is not supported in Revit Macros.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..RibbonItem Autodesk.Revit.UI..::..RibbonButton Autodesk.Revit.UI..::..PushButton Autodesk.Revit.UI..::..ToggleButton
# See Also
ToggleButton Members
Autodesk.Revit.UI Namespace